system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//windTunnel3D 

//patch no2

///////////////////////////////////////////////////////////////////////////////////

actions
(
 {
   name		sourceW;
   type		cellSet;
   action	new;
   source	boxToCell;

   sourceInfo
    {
	box (3.5 0.5 0.5) (3.51 2.5 1.3);
    }
 }

//convert previous cellSet to a cellZone 
 {
   name		sourceWset;
   type		cellZoneSet;
   action	new;
   source	setToCellZone;

  sourceInfo
    {
	 set sourceW;
    }
 }
);

// ************************************************************************* //
